{
    "version": "https://jsonfeed.org/version/1",
    "title": "OppySec",
    "description": "",
    "home_page_url": "https://oppysec.github.io",
    "feed_url": "https://oppysec.github.io/feed.json",
    "user_comment": "",
    "author": {
        "name": "GhostWriter"
    },
    "items": [
        {
            "id": "https://oppysec.github.io/weaponized-pdfs-on-the-rise.html",
            "url": "https://oppysec.github.io/weaponized-pdfs-on-the-rise.html",
            "title": "Ditch Google, And Become A Digital Ghost",
            "summary": "Do you know just how much large corporations like Google and Facebook&hellip;",
            "content_html": "<p>Do you know just how much large corporations like Google and Facebook know about you? Do you like the idea that they know what your favorite shows are, where you like to go on vacation, and what your friends and family look like?</p>\n<p><a name=\"_GoBack\"></a> Even if you close the apps, they’re still running and collecting data on you. It should at least be a given that if the app is closed, it shouldn’t be discovering even more info about youbut massive corporations don’t care about the fact that they’re being sneaky and deceptive. Your privacy is not important to them. The entirety of their billion dollar business model is built around selling your data to the highest bidder so they work against your privacy every chance they get.</p>\n<p>There are a few things you can do to protect yourself and your personal information, such as unlinking certain accounts and switching to a different search engine and email server. But online privacy has many complex details involved in it and often requires a professional security advisor for maximum protection and peace of mind.</p>\n<p>Let’s take a look at some of the ways your data is being collected and what you can do about it.</p>\n<h2 id=\"mcetoc_1ddj8n3lh0\"><a name=\"_8om8r4nrgu5m\"></a>You’re always being watched</h2>\n<p>Keep Google maps on your phone? It knows you spent two hours at the movie theater, one hour in Target, walked across the street to Dick’s Sporting Goods, stayed in there for two hours, walked back across the street to your car parked at Target’s, and then drove the 10-minute route home.</p>\n<p>Google Photos know what your friends and family’s faces looks like (and yours, of course). It knows where you’ve gone on day trips, weekend trips, and out-of-state trips. It has pictures of the places you’ve visited along with the people who went with you.</p>\n<p>Do you have Google Home hanging out at your house? It has your voice, voice inflections, preferences, and routines memorized.</p>\n<p>Your favorite news articles are being pushed in front of you because that’s what Google News knows you like. They track what you read and what you don’t and pay attention to your choices so they can, supposedly, give you the best service possible. At least, that’s what they’d have us believe.</p>\n<p>Youtube knows exactly what type of entertainment keeps you glued to your phone for hours. It knows what style of music videos you like to watch, if baby goat videos are your thing, if you like to watch re-runs of old TV shows, or if you’re more of an educational, documentary type of person.</p>\n<p>And for everything that Google doesn’t know, it has plenty of questions and “suggestions” trying to learn more details about you and your personal life and habits.</p>\n<p>Facebook is just as bad, if not worse. When you sign up with an account, they automatically know your name, email or phone number, gender, and birthday.</p>\n<p>Once you start using Facebook, they keep track of every ad you click on (what you look for and like in your personal life), every single friend, what high school you went to, your maiden name, where you’ve worked at before and where you work now, your hometown, and every single click, like, share, and tag that happens on Facebook.</p>\n<p>Even worse, these apps still gather data on you -- even after you closed them.</p>\n<p>Is it just me, or is that a little creepy?</p>\n<h2 id=\"mcetoc_1ddj8n3li1\"><a name=\"_x9ey5cgclnli\"></a>Why you should fight back</h2>\n<p>Some people just accept such a massive invasion of their privacy as part of the trade-off. Google has convenient features and apps that sync together. People use those features and apps on a daily basis, and they figure it’s not worth giving up just to keep a huge corporation from learning every detail about them.</p>\n<p>But how comfortable are you with that? How safe do you feel knowing that <i>every single </i>search you’ve made <i>could </i>become public? It’s not a far-fetched thought. Scary things like that have happened before, and nobody knows what the future holds.</p>\n<p>Even if a company like Google or Facebook doesn’t voluntarily share your information with certain members of the public (or the government…) they’re still storing that information. What would happen if an employee went rogue and started leaking profile info out? Or what if they got hacked?</p>\n<p>After all, even big corporations aren’t immune to the most sophisticated hackers. In fact, they’re often the biggest targets. And depending on their security systems, one wrong click made by an uninformed employee could compromise the whole system -- including all of your personal info.</p>\n<h2 id=\"mcetoc_1ddj8n3li2\"><a name=\"_z24oh58isjb4\"></a>How to save your privacy</h2>\n<p>There are a few things you can do to escape from the clutches of the massive corporations.</p>\n<p>Replace your Google search engine with DuckDuckGo. DuckDuckGo was specifically created to protect your privacy after the founders saw a rising need and public concern for a search engine that didn’t collect personal data.</p>\n<p>It has pretty much everything the Google search engine has and is a very good alternative when it comes to the results you get from it. And you don’t have to lay awake at night worrying about your personal, private information being watched, analyzed, and manipulated.</p>\n<p>On top of that, replace Gmail with Protonmail. Protonmail, like DuckDuckGo, is also built around protecting your privacy and is a way to further protect your data from large corporations.</p>\n<h2 id=\"mcetoc_1ddj8n3li3\"><a name=\"_vb2xtyiazcv7\"></a>Next Steps</h2>\n<p>It can seem tough to get away from all of the personal and private data-collecting companies out there, especially when they seem like they’re a monopoly.</p>\n<p>Even if you do switch your search engine over to DuckDuckGo and your email server to Protonmail, you’ll still be exposed to Google, Facebook, Microsoft, etc. Google will still know your email address if anybody who has a Gmail account adds you as a contact (or already has you in there as a contact).</p>\n<p>Your friends and family members may have facial recognition turned on in their Google Photos account which works day and night to catologue every photo you’re in. They may also have you tagged in old Facebook pictures.</p>\n<p>It’s so important to protect your data and privacy from companies that use it in questionable ways and who may someday expose it to the public eye. But protecting your privacy is complicated. Often, you need a professional security firm to step in and take care of all of the complex details so your information is as safe and secure as possible.</p>\n<p>With the right steps taken, you’ll be able to wiggle out from underneath the shadow of corporations who have the ability to know and learn way too much about your personal life and preferences.</p>",
            "author": {
                "name": "GhostWriter"
            },
            "tags": [
            ],
            "date_published": "2019-06-14T16:07:00-04:00",
            "date_modified": "2019-06-17T14:18:38-04:00"
        },
        {
            "id": "https://oppysec.github.io/amazon-echo.html",
            "url": "https://oppysec.github.io/amazon-echo.html",
            "title": "As Hacking Rises, Influencers Turn To Cybersecurity Experts",
            "summary": "In March 2018, Atlanta was slammed with a massive cyber attack. The&hellip;",
            "content_html": "<p>In March 2018, <a href=\"https://www.tpx.com/blog/atlanta-suffers-massive-ransomware-attack/\"><span style=\"color: #1155cc;\"><u>Atlanta was slammed with a massive cyber attack.</u></span></a> The hackers demanded $6,800 in Bitcoin to unlock every single computer, coming to a total of $51,000. And worse, there was no guarantee the systems would be restored even after the ransom was paid.</p>\n<p>A huge city with over 480,000 people in it was dangling almost entirely helpless by an elusive enemy they could not track down. Even though the city government fought the attack with security experts and law enforcement, the attackers threatened to erase all of the city’s files if the ransom wasn’t paid by a certain date.</p>\n<p>Six months after the attack, Atlanta was left saddled with the job of finding an extra $9.5 million to fix the damages left behind in the aftermath.</p>\n<p>Hackers are becoming much more sophisticated with their levels of attack. Breaking into individual accounts seems like child’s play after performing a feat like what the hackers did to Atlanta.</p>\n<p>Meanwhile massive data breaches are becoming an almost daily occurance. Atlanta isn’t the only government system to be attacked, and hackers also infiltrate the databses of hospitals and major corporations which hold troves of your sensitive information.</p>\n<p>In the midst of all of this, the world of social media influencers is booming. Nothing is more appealing to an attacker than a wealthy influencer they can attack and ransom. Sometimes, an attack has the potential to wipe out a person’s entire career.</p>\n<p>But hackers are not, in fact, all-powerful. It might surprise you to learn that the government and healthcare systems that have been attacked could’ve been protected fairly easily if they had taken the proper precautions. The first step is to never get so comfortable that you think you’re immune to being hacked. That’s a dangerous attitude to have because it means you can get careless -- playing right into a hacker’s hands.</p>\n<p>However, there are some very practical things you can do to prevent an attack in the first place.</p>\n<h2 id=\"mcetoc_1ddj8kth20\"><a name=\"_s3qalb4qh9bq\"></a>How to protect yourself</h2>\n<p>Here’s how to make sure your account is strongly protected against hackers.</p>\n<h3 id=\"mcetoc_1ddj8kth21\"><a name=\"_vylh2adi4xs8\"></a>1. Create a strong password</h3>\n<p>I know you’ve heard that over and over again, but it can’t be overstated. One of the simplest and easiest ways hackers break into accounts is by guessing a simple password or reusing an old one they discovered.</p>\n<p>Experts recommend you use at least 8 characters in your password, with a mix of uppercase, lowercase, symbols, letters, and numbers. And change your passwords often. Sometimes your passwords can be compromised during a breach of data. If hackers get their hands on those passwords and your password hasn’t been changed in years, your accounts will be in danger.</p>\n<h3 id=\"mcetoc_1ddj8kth22\"><a name=\"_yhspzy9v6ynm\"></a>2. Two-factor authentication</h3>\n<p>Most apps (at least the major ones) now offer the option of two-factor authentication. Make sure you enable two-factor authentication for your accounts to make it harder for hackers to break in.</p>\n<p>What this does is create a situation where nobody can access your account (even if they put in your username and password) until they enter in the second factor, normally a code texted directly to your phone. This adds a double layer of security for you and makes it much exponentially harder for a hacker.</p>\n<h3 id=\"mcetoc_1ddj8kth23\"><a name=\"_49rxfqw1dlw\"></a>3. Stay away from phishing emails</h3>\n<p>“Phishing” emails are fake emails sent out by hackers who are looking for easy prey. The emails may be formatted to look like they’re branded by the app they’re supposedly from. They prompt you to log in to your account from a link embedded inside the email.</p>\n<p>Once you click on the link and enter your username and password, the hacker now knows exactly what information they need to put into your real account. Always double check the url you are sent to and look for the green lock icon to the left of the address for added peace of mind.</p>\n<h2 id=\"mcetoc_1ddj8kth24\"><a name=\"_ggty5x7foida\"></a>Proactively protect your account</h2>\n<p>Once your account has been hacked into, it can be <a href=\"https://mashable.com/article/instagram-account-recovery-process-broken/\"><span style=\"color: #1155cc;\"><u>next to impossible to get back into it.</u></span></a> And even if you are able to recover it, the damage can sometimes be too much to recover from.</p>\n<p>So be extremely proactive in protecting your account. You’ll never look back and wish that you hadn’t created such a strong password, or wish you hadn’t enabled two-factor authentication, or wish you hadn’t double checked that phishing email.</p>\n<p>You’ll just be extremely grateful that you took extra steps and went the extra mile to ensure your account is as protected and safe as possible.</p>\n<h2 id=\"mcetoc_1ddj8kth25\"><a name=\"_6m91o9dep48s\"></a>Wrapping It Up</h2>\n<p>Huge systems in the government, healthcare, and corporate world are regularly being attacked and ransomed by highly sophisticated hackers. Influencers are growing increasingly more and more wealthy, creating the perfect storm for hackers to zero in and strike. Once hacked, it can be impossible to recover your account and information.</p>\n<p>Even if you do pay the ransom and recover your account, you could be left like Atlanta, with your reputation and digital assets damaged beyond repair.</p>\n<p>So be extremely proactive in protecting your account. This can’t be emphasized too much. Once your account has been hacked and your information compromised, it’s often too late. Jumping through hoops with automated responders and trying to get a hold of a real person to help you out can take weeks.</p>\n<p>And even if you are able to talk to a real person about your hacked account, much of the time, there’s still nothing you can do.</p>\n<p>But there are several steps you can take to avoid this. Make sure you create a strong, complex, 8-character password that’s different for each account you have. Change the password often and don’t share your private information with anyone.</p>\n<p>Always enable two-factor authentication for accounts so you have an extra layer of security, other than just your username and password.</p>\n<p>If you see an email land in your inbox that looks like it might be from one of the apps you use asking you to log into your account, delete it and report it as spam. Most apps don’t send emails like that, especially if you didn’t create a brand new account. Instead, if you want to log in to an account you have, do it directly from the app’s interface to ensure you never fall victim to a phishing email.</p>\n<p><a name=\"_GoBack\"></a> Taking the right steps can ensure that all of your accounts are protected, safe, and strong against any attempted hackers.</p>\n<p> </p>",
            "author": {
                "name": "GhostWriter"
            },
            "tags": [
            ],
            "date_published": "2018-06-11T13:06:00-04:00",
            "date_modified": "2019-06-17T14:18:09-04:00"
        }
    ]
}
